brew "zsh"
brew "python"
brew "pipx"
brew "gh"
brew "wget"
brew "zoxide"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "fnm"
brew "bat"
brew "tmux"
brew "codex"
brew "gcc"

# macOS-only casks
if OS.mac?
  cask "1password/tap/1password-cli"
end
