tap "1password/tap"

brew "fnm"
brew "gcc"
brew "gh"
brew "sqlite"
brew "pre-commit"
brew "gnupg"
brew "neovim"
brew "nmap"
brew "tilt"
brew "teleport"
brew "bash"
brew "direnv"
brew "kubectx"
brew "glab"

# macOS-only casks
if OS.mac?
  brew "pinentry-mac"
  cask "1password/tap/1password-cli"
  cask "cursor"
  cask "ghostty"
  cask "docker-desktop"
  cask "gcloud-cli"
end
